## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com/keys/cab567b236dbc91ad8ed42bc918b2746533caeb3" -> (known after apply)
!       name               = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com/keys/cab567b236dbc91ad8ed42bc918b2746533caeb3" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJUWgwZ1NzOVRVaDB3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQXpOVGswT0RRNU16RTBNams1TmpnM01EZzBNQ0FYRFRJeU1UQXhOVEF6TURZeE1Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1ETTFPVFE0TkRrek1UUXlPVGsyT0Rjd09EUXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ3h6cGlmRnRxajA1eGg1Zm44bUdoL1JkMjMKUlY5emsvc1k2bE1yRjZaVGtENnk4MmtqR29NZDdGb2VDei9LWVNqNVVoRWtnUkpKcFZVS1ZtcDV5aGVuSkh1Wgp5dXo2K1I5aVNINU9TZkFQYzBQSW8vcVFWMzE0QUNoRzk2M3l6dFc0YzhBOVlIV2tUQUp6dXl0UVJ4K2pHQUhHClBXT3Y5QWFFOVdGVHV1S3ZNQWZaOGEzYUl5S2kvbG9CaFk4RlpSeGo0UFZsQ0NrUEU4dkF1bFAxRTgrc1lDNDUKM3JZS1M0TCtlSHl0Z3BxWWplNGI3TDRUcGtSUmRHdituWHVYalk2a2dFTXJsTXdSdVc2YVJITEplcWhvaGExRgpnU1JEa0VGSWpqVlZTM1pBeGFSbFlQS0QyekEwdlVlMlRMMGxubUVJRU1iQ2xOelg2T2JucDFtMEJvcmxBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ1JxZnY1bkNEcnBhRWpKR1VLbXB2bgpNT3JPR3hIL1B0NitGajgzdXIzZmFUenRyUkxsWmVZT1dJMTVqbmhlM2thaWJzNDlkalJuQmNpZzViNHZLY0VRCnZXeVBhUWNmakpYb2w0aVM4Y1BOVWg1bENRaVUvSng1c0t2YTRrOWhHTSs2REdVYS83ZXk3SzAyV0FheFFuV1cKWjV6R29iSHk0TkNSelIxSkIwYUVjbGYvOHUwNmJlU2lUT1NsZ0lna3RnZHB3NjRhbk5JU1pDWkVZT1Ayelowbwp1UGYvVjNNbzdNUWozNm5aUXB2eHVneDZ3WVJYVkdNQ2dZait2c2dpZVJOWFZBdUhMdm5Ubyt5R3Z2YmJjWTYvCjBVQ0Mzb1dBNGY1OERhbzRwWGdHMkVxT0U4dWRwV3ZWQ1RoQ28yY2NvdU1ISWs2aUJXdDFuVXJhakNmVGFnL04KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-10-15T03:06:11Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "external-dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be updated in-place
!   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
        id                 = "projects/wayofthesys-cinema-363715/serviceAccounts/external-dns@wayofthesys-cinema-363715.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
!       members            = [
-           "serviceAccount:wayofthesys-cinema-363715.svc.id.goog[dns/gke-external-dns]",
+           "serviceAccount:wayofthesys-cinema-363715.svc.id.goog[external-dns/gke-external-dns]",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
